   - [#   1] AOR my_code: 
--------------------------------------------------------------------------------
  1: def contas(a, b):
- 2:     c = a + b
+ 2:     c = a - b
  3:     d = c - 1
  4:     if d > 10:
  5:         return d + 10
  6:     else:
--------------------------------------------------------------------------------
[0.00554 s] killed by test_add (test_my_code.TestAdd)

   - [#   2] AOR my_code: 
--------------------------------------------------------------------------------
  1: def contas(a, b):
  2:     c = a + b
- 3:     d = c - 1
+ 3:     d = c + 1
  4:     if d > 10:
  5:         return d + 10
  6:     else:
  7:         return d
--------------------------------------------------------------------------------
[0.00540 s] killed by test_add (test_my_code.TestAdd)

   - [#   3] AOR my_code: 
--------------------------------------------------------------------------------
  1: def contas(a, b):
  2:     c = a + b
  3:     d = c - 1
  4:     if d > 10:
- 5:         return d + 10
+ 5:         return d - 10
  6:     else:
  7:         return d
--------------------------------------------------------------------------------
[0.00394 s] survived

   - [#   4] COI my_code: 
--------------------------------------------------------------------------------
  1: def contas(a, b):
  2:     c = a + b
  3:     d = c - 1
- 4:     if d > 10:
+ 4:     if not (d > 10):
  5:         return d + 10
  6:     else:
  7:         return d
--------------------------------------------------------------------------------
[0.00459 s] killed by test_add (test_my_code.TestAdd)

   - [#   5] ROR my_code: 
--------------------------------------------------------------------------------
  1: def contas(a, b):
  2:     c = a + b
  3:     d = c - 1
- 4:     if d > 10:
+ 4:     if d < 10:
  5:         return d + 10
  6:     else:
  7:         return d
--------------------------------------------------------------------------------
[0.00633 s] killed by test_add (test_my_code.TestAdd)

   - [#   6] ROR my_code: 
--------------------------------------------------------------------------------
  1: def contas(a, b):
  2:     c = a + b
  3:     d = c - 1
- 4:     if d > 10:
+ 4:     if d >= 10:
  5:         return d + 10
  6:     else:
  7:         return d
--------------------------------------------------------------------------------
[0.00359 s] survived
